const novelData = [
    {
        id: 1,
        title: "第1編：プロローグ",
        summary: `私は、なにかがしたかったんだろう。
わからない、私の罪も、正義も。
眩しいあの人たちといると、わからなくなる。
眩しくて、周りが見えないから。`,
        // 各話のリスト（何話でも自由に追加可能）
        episodes: [
            { 
                title: "第1話：始まる未来", 
                text: `綺麗な暗い青色の髪を靡かせ、わずか28年しか生きていないはずのその大魔法使いは、どこか儚げな表情をし、分厚くて古びた本を次々と捲っていく。そして、そこに書かれた物語をまるで、その現場で惨状を体験していたかのように、未来を紡ぎ繋いでゆく誰かに話している。
その本に遺された記憶と歴史は、この地にはなかったはずの、非現実的で、存在しない物語だとされているが、かつて何度もあったかのような激闘と苦しみ、そして希望が詰まっている…そして…。
この本を書いたのは他でもない歴史に刻まれし大魔法使い、レオナリア　マギプレーメ。そして彼女は、とあるページで手が止まる。そこに書かれた物語は、存在したかもしれない過去の彼方に消され、そしてなかったことにされていった。

でもその物語には、確かになにか大切な欠片がどこかにあるはずで、それを見つけるための────

『365回目のやり直し』

──♤レフィダー視点♡◇リビング♧──
〚兄さん、何作るの？〛
俺の兄さんがキッチン棚から大きな鍋を取り出しているのを見て、期待を抱えてキッチンに近づいて聞くと、兄さんは準備している手を止めて俺の方を見て、いつもの笑顔を見せる。
「あぁ、今日はレフィダーの大好物な甘辛アサリスープにしようと思ってな。」
〚えっ本当に！やった！〛
〚レフィダーはいつも頑張ってるからな、でも作るのに手間も時間もかかるから毎日は作れないんだけど…〛
〚ううん、作ってくれるだけでもすごく嬉しい！なにか手伝えることないかな？〛
兄さんの真隣に立って包丁を取ってまな板に置かれた人参を指差して切っていいか聞こうとしたその時に、兄さんは優しく俺の包丁を握る手を優しく包み込んで包丁を取り上げる。
「なら、アサリの砂抜きとか、他の野菜洗っていってくれる？包丁は怪我したら危ないから、それは俺がやるから。」
〚兄さん。俺…もう高3だよ？もう成人もしてるんだから、そんな子供みたいに扱わないでよ……。〛
「…あのな、俺にとって、レフィダーは他の誰よりも大切な存在なんだ。レフィダーにとっては平気でも、俺はちょっとした怪我もして欲しくないんだ。」
〚……でも、俺は兄さんを支えたいんだ。〛
「それは嬉しいよ、だけど、せめて、大学を終えるまでは俺にレフィダーを守らせてくれないか？」
〚うん、でも、大学が終わったら兄さんと一緒に宇宙管理軍で仕事して、支えるから。恩返しもしたいんだ。〛
「恩なんて…俺は俺のしたいことをしただけだよ。でも、それがレフィダーのやりたいことなら、俺はそれを尊重するよ。」
〚うん、それが俺の夢だから…。〛
「じゃあ、そろそろ戦い方も教えないと行けないな。」
〚そっか、管理軍だから……当たり前か。〛
大学を終えたら、管理軍に入って、兄孝行をして、兄さんの隣で歩きたい、そのためにはまず大学に受からないとな。
「夜ごはんを食べ終わって、歯磨きしたら、今日は早寝しような。明日は文化祭だろ？それに、明日は第4部隊隊長の涼音さんがレフィダーに会いたいらしくてな。」
〚あ、しるさんとか、セヴェーさんじゃないんだ。それにしても第4部隊の…隊長？なんで？〛
「あぁ、しるもセヴェーも隊長と副隊長だし、意外とそんなに時間はねぇんだよな。それと…涼音さんはなんか、コーディネートしたい…だとか言ってたな。」
コーディネート？…文化祭だからとか…かな。
〚でも…兄さん……その……〛
兄さんの手が俺の頭をわしゃわしゃと触って、愛おしそうに俺を見る。
「大丈夫、なんとかするよ。」
〚それなら……〛
兄さんは俺にとって大事な存在だ。俺が小さいときからずっと、育ててくれた。ネグレクトと暴力の父親から守ってくれていたんだ、俺にとって眩しいけどずっと見ていたい憧れの光のようで、その光に守られてきたから、今度は俺が隣に立ちたい。母親…は完全な毒親というほどではなかったけれど、何かを褒めることせず、ただ毎日のように言った。
「私のように心まで偽善者になるな。」
俺が悩み事を相談した時も、母親は聞く耳すら持たなかった。それを支えてくれたのも、助けてくれたのも、手伝ってくれたのも全部兄さんだった。
「そういや、文化祭って家族も参加しちゃダメなんだっけ、悲しいな、レフィダーのメイド姿見たかったのに。」
〚俺のクラスそもそもメイド喫茶じゃないし！ちょっとした小さな劇で、俺裏方だし…〛
「仕方ないか、高校に変な人が入ってきても行けないからって理由だし、レフィダーが安全に楽しめるならいいか。」
〚変な人…この高校は警備があるんだし、そうそう事件なんて起きないと思うけど…〛
「…あ、そうだ。」
兄さんが手を止めて、スマホを持ってくると、ある女性の写真を見せてくる。その女性は赤と濃い紺色のお団子髪で、大きいお団子髪にも関わらず横髪と、少し後ろ髪が落ちている、そして赤色の目と、露出の多い服。
「…もしこの人を見つけたら、俺に言ってほしい。」
〚この人は？〛
「『世界回帰理論』を証明した人だ。俺は少し手伝っただけなんだが、それでも仲間だから…行方不明ともなれば、探さないとだろ？」
〚世界回帰理論…それって……〛
「あぁ、前に何度か言っただろ？すごく頭が良い人なんだ。」
世界回帰理論…世界が特定の時間を軸に何度も誰かの手によって、もしくはこの世界という秩序によってやり直されているという理論。兄さんは、その女性に知能と知識を貸して、証明するのを手伝って、2年前にほとんど完全な証明ができた。でも、その特定の時間の完全な特定ができていないことから、回帰の時間は多少前後すると仮定されていて、誰かが何度もやり直してる説が濃厚なんて兄さんに言われたことがあるけど…そんなことできる人なんて…、いるとしたら、何度も教科書に載るような最古の悪魔術師とか、相当すごい能力でもないと無理なんじゃないかな…？兄さんは、さすがにそこまではわからないと言っていたけど。

──♤レフィダー視点♡1時間後◇♧──
〚ごちそうさま、兄さん。すごく美味しかった。〛
「喜んでもらえてよかったよ、レフィダーの笑顔のためなら俺はなんでもするから、何かあれば言ってくれればいいからな。」
〚…うん、ありがとう。〛
俺はせめて皿洗いだけでもしようと、キッチンに立って蛇口を捻って洗い始める。すると兄さんは、まるで親のお手伝いをした小さな子供の頭を撫でるように、俺の髪を愛おしそうに頭を乱暴に撫で下ろす。俺は肩で嫌がるように抵抗するけど…兄さんは構わず、むしろハグしてくる勢いで抱き寄せてくるから諦めて皿洗いを続ける。そう、兄さんは自他ともに認めるブラコンだ。俺も相当のブラコンなのは自覚してるけど、兄さんのブラコン度は群を抜くようなレベルだろう。
「やっぱり俺の弟は最高に可愛いなぁ、こんなの可愛がらない方が無理だって話だよ。」
そう言ってきつく抱きしめてくるせいで、ちょっと背中が痛い。でも、それ以外は完璧な俺の兄さんだ。
〚でも…兄さん、ちょっと苦しい……〛
「おっとすまんすまん、つい……じゃ、もう9時だし、文化祭に備えて歯磨きしたら寝ような。」
〚いや、まだ早いから。いつも日付すぎるギリギリくらいまで起きてるのにそんな早くに寝たら朝4時くらいに起きちゃうって。〛
「でも、明日は涼音さんが来るしな〜…」
〚それでも9時は早いから！もう…兄さんは心配性なんだから…。〛
そう言って俺は歯磨きした後、明日の荷物の準備をし、兄さんのナデナデ攻撃を受けながら受験勉強を夜遅くまでした後、やっと就寝する…。`,
            },
            { 
                title: "第2話：最後の祭り", 
                text: `本文...`
            },
            { 
                title: "第3話：暴走と事件", 
             　　text: `本文...`
            },
            { 
                title: "第4話：少年の保護",
             　　text: `本文...` 
            },
            {
                title: "第5話：遺品と会場",
                　text: `本文...` 
            },
            {
                title: "第6話：理論値とは",
                　text: `本文...` 
            },
            {
                title: "第7話：推薦と戦争",
                　text: `本文...` 
            },
            {
                title: "第8話：軍の強者達",
                　text: `本文...` 
            },
            {
                title: "第9話：7強の無双",
                　text: `本文...` 
            },
            {
                title: "第10話：敵の狙いは",
                　text: `本文...` 
            },
        ],
        // みりおり
        miriori: `みりたんのぉ〜希創回記！オリジナルコーナー！

略してみりオリ！いえ〜い！希創記を楽しんでもらうためにぃ〜みりたんが張り切って説明しちゃうよぉ〜！
まずはみりたんの紹介だねぇ〜！名前はミリア　プリティーベリー！みりたんって呼んでね！

此処ではね〜！作中では解説されない世界の常識？とか色々解説してくよ〜！みりたんは結構この世界について知ってるから〜みんなの助けになれると思うな〜！じゃ、まったね〜！`
    },
//💡 第2編、第3編…と増やしたい時は、下にカンマ（,）を打って塊を増やせます（第39編まで同様）
    {
        id: 2,
        title: "第2編：今までの生活にお別れを",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第11話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 3,
        title: "第3編：入軍試験～トップ合格を目指して",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 4,
        title: "第4編：新しい環境と共に歩む仲間たち",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 5,
        title: "第5編：色んな部隊を巡ろうの会！",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 6,
        title: "第6編：審穏連なる不の連鎖",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 7,
        title: "第7編：回顧夢と記憶の欠片",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 8,
        title: "第8編：25位以内を目指せ！軍内ランク戦前半！",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 9,
        title: "第9編：続く激戦の軍内ランク戦期間後半"！,
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 10,
        title: "第10編：第二次月界侵攻・前編",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 11,
        title: "第11編：第二次月界侵攻・中編",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 12,
        title: "第12編：第二次月界侵攻・後編",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 13,
        title: "第13編：望まぬ結果と裏の秘密",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 14,
        title: "第14編：眩しく輝く世界と歪な再開",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 15,
        title: "第15編：軍の新技術と教える身として",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 16,
        title: "第16編：天才とはなにを示すのか",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 17,
        title: "第17編：国同士の戦争と狂気",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 18,
        title: "第18編：狂愛の娘の暴走の果てに",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 19,
        title: "第19編：狂人化学者と落ちぶれた科学者",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 20,
        title: "第20編：親友の別離と不穏すぎる静けさ",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 21,
        title: "第21編：血焉襲域・前編",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 22,
        title: "第22編：血焉襲域・中編",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 23,
        title: "第23編：血焉襲域・後編",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 24,
        title: "第24編：戻ってきた過去の思い出",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 25,
        title: "第25編：ハルノイエに導かれて",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 26,
        title: "第26編：掘り返す過去に良い事無し",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 27,
        title: "第27編：隠した君の知らない姿",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 28,
        title: "第28編：違う私の過去を今で塗りつぶして",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 29,
        title: "第29編：入軍試験～未来照らす希望の少女",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 30,
        title: "第30編：自主鍛錬と世の厳しさ",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 31,
        title: "第31編：宇宙に渦巻く覇壊の暴走",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 32,
        title: "第32編：絶望と希望に包まれた世代交代",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 33,
        title: "第33編：謎多き新人社長と拾われし少女たち",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 34,
        title: "第34編：覚醒した時空の支配者",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 35,
        title: "第35編：狂い切った裏切りと切れぬ命絆",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 36,
        title: "第36編：加害者を探し動く世界の英雄",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 37,
        title: "第37編：最初で最期の復讐",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 38,
        title: "第38編：英雄不在の第三次月界侵攻",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
    {
        id: 39,
        title: "第39編：ただ全てを終わらす全能神の手",
        summary: `予告文章...`,
        episodes: [
            { 
                title: "第?話：〇〇",
                  text: "本文..."
            }
        ],
        miriori: "今回は〜..."
    },
];
